In [1]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (1.3.9)
Requirement already satisfied: ibm_db_sa in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (0.3.3)
Requirement already satisfied: sqlalchemy>=0.7.3 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ibm_db_sa) (1.3.9)

In [7]:
import ibm_db

In [1]:
%load_ext sql

In [2]:
%sql ibm_db_sa://fjq00738:pk5lkxrv%2B4rzqqcp@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB

'Connected: fjq00738@BLUDB'

In [6]:
%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES \
      where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC')

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('FJQ00738', 'TEST', datetime.datetime(2021, 6, 24, 16, 38, 41, 483139)),
 ('FJQ00738', 'PETSALE', datetime.datetime(2021, 6, 24, 16, 58, 24, 60252)),
 ('FJQ00738', 'COUNTRY', datetime.datetime(2021, 6, 24, 17, 3, 56, 29809)),
 ('FJQ00738', 'EMPLOYEES', datetime.datetime(2021, 6, 24, 17, 14, 16, 613572)),
 ('FJQ00738', 'JOB_HISTORY', datetime.datetime(2021, 6, 24, 17, 14, 17, 76447)),
 ('FJQ00738', 'JOBS', datetime.datetime(2021, 6, 24, 17, 14, 17, 539163)),
 ('FJQ00738', 'DEPARTMENTS', datetime.datetime(2021, 6, 24, 17, 14, 18, 34943)),
 ('FJQ00738', 'LOCATIONS', datetime.datetime(2021, 6, 24, 17, 46, 44, 103714)),
 ('FJQ00738', 'PETRESCUE', datetime.datetime(2021, 6, 24, 21, 48, 36, 686615)),
 ('FJQ00738', 'INSTRUCTOR', datetime.datetime(2021, 6, 25, 22, 54, 45, 989140)),
 ('FJQ00738', 'INTERNATIONAL_STUDENT_TEST_SCORES', datetime.datetime(2021, 6, 25, 23, 20, 23, 990952)),
 ('FJQ00738', 'CHICAGO_SOCIOECONOMIC_DATA', datetime.datetime(2021, 6, 25, 23, 51, 40, 546315)),
 ('FJQ00738', 'SCHOOLS', datetime.datetime(2021, 6, 26, 0, 36, 24, 886024))]

In [4]:
%sql select count(*) as total_rows from schools;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('566'),)]

In [68]:
### type in your query to retrieve the number of columns in the SCHOOLS table

%sql select count(*) as tota_columns from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS'

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('78'),)]

In [19]:
### type in your query to retrieve all column names in the SCHOOLS table along with their datatypes and length


##%sql select COLNAME, TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS'


%sql select distinct(NAME), COLTYPE, LENGTH from SYSIBM.SYSCOLUMNS where TBNAME = 'SCHOOLS'

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('10th Grade PLAN (2009)', 'VARCHAR ', 4),
 ('10th Grade PLAN (2010)', 'VARCHAR ', 4),
 ('11th Grade Average ACT (2011)', 'VARCHAR ', 4),
 ('9th Grade EXPLORE (2009)', 'VARCHAR ', 4),
 ('9th Grade EXPLORE (2010)', 'VARCHAR ', 4),
 ('AVERAGE_STUDENT_ATTENDANCE', 'VARCHAR ', 6),
 ('Adequate_Yearly_Progress_Made_', 'VARCHAR ', 3),
 ('Average_Teacher_Attendance', 'VARCHAR ', 6),
 ('COLLEGE_ENROLLMENT', 'SMALLINT', 2),
 ('COMMUNITY_AREA_NAME', 'VARCHAR ', 22),
 ('COMMUNITY_AREA_NUMBER', 'SMALLINT', 2),
 ('CPS_Performance_Policy_Level', 'VARCHAR ', 15),
 ('CPS_Performance_Policy_Status', 'VARCHAR ', 16),
 ('City', 'VARCHAR ', 7),
 ('Collaborative_Name', 'VARCHAR ', 34),
 ('College_Eligibility__', 'VARCHAR ', 4),
 ('College_Enrollment_Rate__', 'VARCHAR ', 4),
 ('Elementary, Middle, or High School', 'VARCHAR ', 2),
 ('Environment_Icon', 'VARCHAR ', 11),
 ('Environment_Score', 'SMALLINT', 2),
 ('Family_Involvement_Icon', 'VARCHAR ', 11),
 ('Family_Involvement_Score', 'VARCHAR ', 3),
 ('Freshman_on_Track_Rate__', 'VARCHAR ', 4),
 ('General_Services_Route', 'SMALLINT', 2),
 ('Gr3_5_Grade_Level_Math__', 'VARCHAR ', 4),
 ('Gr3_5_Grade_Level_Read__', 'VARCHAR ', 4),
 ('Gr3_5_Keep_Pace_Math__', 'VARCHAR ', 4),
 ('Gr3_5_Keep_Pace_Read__', 'VARCHAR ', 4),
 ('Gr6_8_Grade_Level_Math__', 'VARCHAR ', 4),
 ('Gr6_8_Grade_Level_Read__', 'VARCHAR ', 4),
 ('Gr6_8_Keep_Pace_Math_', 'VARCHAR ', 4),
 ('Gr6_8_Keep_Pace_Read__', 'VARCHAR ', 4),
 ('Gr_8_Explore_Math__', 'VARCHAR ', 4),
 ('Gr_8_Explore_Read__', 'VARCHAR ', 4),
 ('Graduation_Rate__', 'VARCHAR ', 4),
 ('HEALTHY_SCHOOL_CERTIFIED', 'VARCHAR ', 3),
 ('ISAT_Exceeding_Math__', 'DECIMAL ', 5),
 ('ISAT_Exceeding_Reading__', 'DECIMAL ', 5),
 ('ISAT_Value_Add_Color_Math', 'VARCHAR ', 6),
 ('ISAT_Value_Add_Color_Read', 'VARCHAR ', 6),
 ('ISAT_Value_Add_Math', 'DECIMAL ', 3),
 ('ISAT_Value_Add_Read', 'DECIMAL ', 3),
 ('Individualized_Education_Program_Compliance_Rate', 'VARCHAR ', 7),
 ('Instruction_Icon', 'VARCHAR ', 11),
 ('Instruction_Score', 'SMALLINT', 2),
 ('Latitude', 'DECIMAL ', 18),
 ('Leaders_Icon', 'VARCHAR ', 4),
 ('Leaders_Score', 'VARCHAR ', 3),
 ('Link', 'VARCHAR ', 78),
 ('Location', 'VARCHAR ', 27),
 ('Longitude', 'DECIMAL ', 18),
 ('NAME_OF_SCHOOL', 'VARCHAR ', 65),
 ('Net_Change_EXPLORE_and_PLAN', 'VARCHAR ', 3),
 ('Net_Change_PLAN_and_ACT', 'VARCHAR ', 3),
 ('Network_Manager', 'VARCHAR ', 40),
 ('Parent_Engagement_Icon', 'VARCHAR ', 7),
 ('Parent_Engagement_Score', 'VARCHAR ', 3),
 ('Parent_Environment_Icon', 'VARCHAR ', 7),
 ('Parent_Environment_Score', 'VARCHAR ', 3),
 ('Phone_Number', 'VARCHAR ', 14),
 ('Pk_2_Literacy__', 'VARCHAR ', 4),
 ('Pk_2_Math__', 'VARCHAR ', 4),
 ('Police_District', 'SMALLINT', 2),
 ('Rate_of_Misconducts__per_100_students_', 'DECIMAL ', 5),
 ('SAFETY_SCORE', 'SMALLINT', 2),
 ('Safety_Icon', 'VARCHAR ', 11),
 ('School_ID', 'INTEGER ', 4),
 ('State', 'VARCHAR ', 2),
 ('Street_Address', 'VARCHAR ', 29),
 ('Students_Passing__Algebra__', 'VARCHAR ', 4),
 ('Students_Taking__Algebra__', 'VARCHAR ', 4),
 ('Teachers_Icon', 'VARCHAR ', 11),
 ('Teachers_Score', 'VARCHAR ', 3),
 ('Track_Schedule', 'VARCHAR ', 12),
 ('Ward', 'SMALLINT', 2),
 ('X_COORDINATE', 'DECIMAL ', 13),
 ('Y_COORDINATE', 'DECIMAL ', 13),
 ('ZIP_Code', 'INTEGER ', 4)]

In [20]:
##Questions
##Is the column name for the "SCHOOL ID" attribute in upper or mixed case? yes
##What is the name of "Community Area Name" column in your table? Does it have spaces? COMMUNITY_AREA_NAME, no spaces
#Are there any columns in whose names the spaces and paranthesis (round brackets) have been replaced by the underscore character "_"? yes

In [83]:
# %sql select distinct(NAME), COLTYPE, LENGTH from SYSIBM.SYSCOLUMNS where TBNAME = 'SCHOOLS'

%sql select count name_of_school from schools;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('566'),)]

In [95]:
#%sql SELECT count(*) from schools WHERE name_of_school like "%ele%";
%sql SELECT name_of_school from schools WHERE type_name like "%elen%";

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0206N  "TYPE_NAME" is not valid in the context where it is used.  SQLSTATE=42703 SQLCODE=-206
[SQL: SELECT name_of_school from schools WHERE type_name like "%elen%";]
(Background on this error at: http://sqlalche.me/e/f405)

In [89]:
%sql select count(*) from SCHOOLS where school_id  = "es";

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0206N  "SCHOOL_ID" is not valid in the context where it is used.  SQLSTATE=42703 SQLCODE=-206
[SQL: select count(*) from SCHOOLS where school_id  = "es";]
(Background on this error at: http://sqlalche.me/e/f405)

In [97]:
%sql select max (SAFETY_SCORE) as max_safety_score  from schools;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(99,)]

In [98]:
%sql select name_of_school, safety_score from schools  where safety_score =99;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Abraham Lincoln Elementary School', 99),
 ('Alexander Graham Bell Elementary School', 99),
 ('Annie Keller Elementary Gifted Magnet School', 99),
 ('Augustus H Burley Elementary School', 99),
 ('Edgar Allan Poe Elementary Classical School', 99),
 ('Edgebrook Elementary School', 99),
 ('Ellen Mitchell Elementary School', 99),
 ('James E McDade Elementary Classical School', 99),
 ('James G Blaine Elementary School', 99),
 ('LaSalle Elementary Language Academy', 99),
 ('Mary E Courtenay Elementary Language Arts Center', 99),
 ('Northside College Preparatory High School', 99),
 ('Northside Learning Center High School', 99),
 ('Norwood Park Elementary School', 99),
 ('Oriole Park Elementary School', 99),
 ('Sauganash Elementary School', 99),
 ('Stephen Decatur Classical Elementary School', 99),
 ('Talman Elementary School', 99),
 ('Wildwood Elementary School', 99)]

In [5]:
%sql select name_of_school, average_student_attendance from schools; ***(SO ITS NOT SO LONG)

UsageError: Line magic function `%sql` not found.

In [105]:
%sql select name_of_school, average_student_attendance from schools order by average_student_attendance desc  nulls \
last limit 10;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

In [5]:
#retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

%sql select name_of_school, average_student_attendance from schools order by average_student_attendance asc  nulls \
last limit 5;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

In [19]:
#Now remove the '%' sign from the above result set for Average Student Attendance column

%sql select name_of_school, replace (average_student_attendance, '%','') from schools order by average_student_attendance asc  nulls \
last limit 5;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30')]

In [33]:
#Which Schools have Average Student Attendance lower than 70%?

 %sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     where DECIMAL ( REPLACE(Average_Student_Attendance, '%', '') ) < 70 \
     order by Average_Student_Attendance

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%'),
 ('Manley Career Academy High School', '66.80%'),
 ('Chicago Vocational Career Academy High School', '68.80%'),
 ('Roberto Clemente Community Academy High School', '69.60%')]

In [41]:
#Get the total College Enrollment for each Community Area

 %sql SELECT sum (college_enrollment) \
     from SCHOOLS ;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(354346,)]

In [38]:
 %sql SELECT sum (college_enrollment) as total_enrollment\
     from SCHOOLS

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(354346,)]

In [4]:
#Get the total College Enrollment for each Community Area

%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \ ***SO ITS NOT SO LONG
   from SCHOOLS \
   group by Community_Area_Name

IndentationError: unexpected indent (<ipython-input-4-16294780eaba>, line 4)

In [49]:
#Get the 5 Community Areas with the least total College Enrollment sorted in ascending order

%sql select Community_Area_Name, sum(College_Enrollment) from schools;  ***(SO IT )



#%sql select name_of_school, average_student_attendance from schools order by average_student_attendance asc  nulls \
#last limit 5;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0119N  An expression starting with "COMMUNITY_AREA_NAME" specified in a SELECT clause, HAVING clause, or ORDER BY clause is not specified in the GROUP BY clause or it is in a SELECT clause, HAVING clause, or ORDER BY clause with a column function and no GROUP BY clause is specified.  SQLSTATE=42803 SQLCODE=-119
[SQL: select Community_Area_Name, sum(College_Enrollment) from schools;]
(Background on this error at: http://sqlalche.me/e/f405)

In [3]:
%sql select Community_Area_Name, College_Enrollment from schools order by community_area_name asc;  ***(SO ITS NOT SO LONG )

UsageError: Line magic function `%sql` not found.

In [2]:
#Get the Community Areas with the least total College Enrollment  sorted in descending order

%sql select Community_Area_Name, College_Enrollment\* (SO ITS NOT SO LONG)
from schools \
where college_enrollment\
order by College_Enrollment desc;

SyntaxError: invalid syntax (<ipython-input-2-c699f4698b33>, line 5)

In [67]:
#Get the Community Areas with the least total College Enrollment  sorted in descending order

%sql select Community_Area_Name, College_Enrollment\
from schools order by \
college_enrollment desc limit 5;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('NORTH CENTER', 4368),
 ('ARCHER HEIGHTS', 3320),
 ('NORWOOD PARK', 2922),
 ('BRIGHTON PARK', 2883),
 ('IRVING PARK', 2366)]

In [79]:
#Get the 5 Community Areas with the least total College Enrollment sorted in ascending order

%sql select Community_Area_Name, College_Enrollment\
from schools order by \
college_enrollment asc limit 5;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('NEAR WEST SIDE', 21),
 ('CALUMET HEIGHTS', 26),
 ('ENGLEWOOD', 44),
 ('NORTH LAWNDALE', 48),
 ('NORTH LAWNDALE', 83)]

In [76]:
#Get the 5 Community Areas with the least total College Enrollment sorted in ascending order

%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
   from SCHOOLS \
   group by Community_Area_Name \
   order by TOTAL_ENROLLMENT asc \
   fetch first 5 rows only

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('OAKLAND', 140),
 ('FULLER PARK', 531),
 ('BURNSIDE', 549),
 ('OHARE', 786),
 ('LOOP', 871)]

In [1]:
#Get the  Community Areas with the least total College Enrollment  sorted in ascending order

%sql select Community_Area_Name, College_Enrollment\  ***(SO ITS NOT SO LONG)
from schools \
where college_enrollment\
order by College_Enrollment asc;

SyntaxError: invalid syntax (<ipython-input-1-16046bf970c7>, line 5)

In [87]:
#List 5 schools with lowest safety score.
%sql SELECT name_of_school, safety_score\
FROM schools \
ORDER BY safety_score\
LIMIT 5

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Edmond Burke Elementary School', 1),
 ("Luke O'Toole Elementary School", 5),
 ('George W Tilton Elementary School', 6),
 ('Foster Park Elementary School', 11),
 ('Emil G Hirsch Metropolitan High School', 13)]

In [111]:
#List 5 schools with hightes safety score. organizes ascending by default
#(picks up nulls. need to remove it)
%sql SELECT name_of_school, safety_score\
FROM schools \
ORDER BY safety_score asc \
LIMIT 5

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Edmond Burke Elementary School', 1),
 ("Luke O'Toole Elementary School", 5),
 ('George W Tilton Elementary School', 6),
 ('Foster Park Elementary School', 11),
 ('Emil G Hirsch Metropolitan High School', 13)]

In [112]:
#List 5 schools with lowest safety score.
#(picks up nulls. need to remove it)
%sql SELECT name_of_school, safety_score\
FROM schools \
ORDER BY safety_score desc \
LIMIT 5

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Ariel Elementary Community Academy', None),
 ('Cyrus H McCormick Elementary School', None),
 ('Blair Early Childhood Center', None),
 ('Barbara Vick Early Childhood & Family Center', None),
 ('Arthur R Ashe Elementary School', None)]

In [115]:
#List 5 schools with lowest safety score.
#(picks up nulls. need to remove it) ===NO NULLS
%sql SELECT name_of_school, safety_score\
FROM schools \
ORDER BY safety_score desc nulls\
last limit 5;

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Abraham Lincoln Elementary School', 99),
 ('Alexander Graham Bell Elementary School', 99),
 ('Annie Keller Elementary Gifted Magnet School', 99),
 ('Augustus H Burley Elementary School', 99),
 ('Edgar Allan Poe Elementary Classical School', 99)]

In [117]:
#List 5 schools with lowest safety score
%sql SELECT name_of_school, safety_score\
FROM schools\
ORDER BY safety_score\
LIMIT 5

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Edmond Burke Elementary School', 1),
 ("Luke O'Toole Elementary School", 5),
 ('George W Tilton Elementary School', 6),
 ('Foster Park Elementary School', 11),
 ('Emil G Hirsch Metropolitan High School', 13)]

In [119]:
#Get the hardship index for the community area which has College Enrollment of 4368


#<!-- Solution:
#NOTE: For this solution to work the CHICAGO_SOCIOECONOMIC_DATA table 
     # as created in the last lab of Week 3 should already exist

%sql select hardship_index \
   from chicago_socioeconomic_data CD, schools CPS \
   where CD.ca = CPS.community_area_number \
      and college_enrollment = 4368

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(6.0,)]

In [120]:
#Get the hardship index for the community area which has the school with the highest enrollmen



#<!-- Solution:
#NOTE: For this solution to work the CHICAGO_SOCIOECONOMIC_DATA table 
      #as created in the last lab of Week 3 should already exist

%sql select ca, community_area_name, hardship_index from chicago_socioeconomic_data \
   where ca in \
   ( select community_area_number from schools order by college_enrollment desc limit 1 )

 * ibm_db_sa://fjq00738:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(5.0, 'North Center', 6.0)]